app/controllers/products_controller.rb

   def index
     @store = Store.find_by(id: params[:store_id])
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def new
    @store = Store.find_by(id: params[:store_id])
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

def create
  @store = Store.find_by(id: params[:store_id])
  if @store
    @product = @store.products.build(product_params)
    if @product.save
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "products" ("name", "store_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Pupu"], ["store_id", 1], ["created_at", "2017-05-25 13:32:38.922797"], ["updated_at", "2017-05-25 13:32:38.922797"]]