app/controllers/stores_controller.rb

  def index
    if params.key?(:query)
      @stores = Store.where('stores.name LIKE ?', "%#{params[:query]}%")
    else
      @stores = Store.all
---
SELECT "stores".* FROM "stores" WHERE (stores.name LIKE '%cosco%')
SELECT "stores".* FROM "stores"

def create
    @store = Store.new(store_params)

    respond_to do |format|
      if @store.save
---
INSERT INTO "stores" ("name", "kind", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Cosco"], ["kind", "electronics"], ["created_at", "2017-05-24 13:18:28.586953"], ["updated_at", "2017-05-24 13:18:28.586953"]]

  def destroy
      @store.destroy
---
DELETE FROM "stores" WHERE "stores"."id" = $1  [["id", 1]]

  def set_store
    @store = Store.find(params[:id])
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]