app/controllers/stores_controller.rb

  def show
    @store = Store.first
---
SELECT  "stores".* FROM "stores" ORDER BY "stores"."id" ASC LIMIT $1  [["LIMIT", 1]]